@InputObject2 can you provide detailed steps for reproducing the issue (terraform version, provider version before, terraform code for the VM)?

I tried to reproduce it through [this acceptance test](https://github.com/terra-farm/terraform-provider-xenorchestra/compare/master...ddelnano/reproduce-and-fix-gh-267#diff-f952c71b35aba699729084808af391a12a5f800c0ad8825fccfcdcd264f393ffR1477), which simulates creating a VM with v0.24.2 of the provider followed by a `terraform plan` with v0.25.0. I was expected the second step to have a non empty plan with the diff you provided, however, the plan is empty. I thought that this issue might be terraform version dependent, so I ran the test with v0.14.11 and v1.6.0 but I didn't see any difference in behavior.

<details><summary>terraform acc test</summary>

```
TEST=TestAccXenorchestraVm_createWithV0StateMigration make testacc

=== RUN   TestAccXenorchestraVm_createWithV0StateMigration
=== PAUSE TestAccXenorchestraVm_createWithV0StateMigration
=== CONT  TestAccXenorchestraVm_createWithV0StateMigration
    resource_xenorchestra_vm_test.go:1480: Step 2/2 error: Expected a non-empty plan, but got an empty plan
--- FAIL: TestAccXenorchestraVm_createWithV0StateMigration (81.51s)
FAIL
[DEBUG] Running sweeper
FAIL    github.com/ddelnano/terraform-provider-xenorchestra/xoa 110.467s
FAIL
make: *** [Makefile:40: testacc] Error 1

# Testing against terraform 1.6.0
export TF_ACC_TERRAFORM_VERSION=1.6.0
TEST=TestAccXenorchestraVm_createWithV0StateMigration make testacc

# Fails with the same error
```

</details>

I also performed the same test manually and could not reproduce the issue.
<details><summary>Manual test output</summary>

```
acaddress.mac: Refreshing state... [id=00:aa:af:cb:12:42]
xenorchestra_cloud_config.bar: Refreshing state... [id=051e055b-cbd0-4f16-843a-de55376ac96b]
xenorchestra_vm.vm: Refreshing state... [id=7af4a81c-fa5d-9b5b-e864-15564c02ff7f]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # xenorchestra_vm.vm will be created
  + resource "xenorchestra_vm" "vm" {
      + auto_poweron      = false
      + cloud_config      = <<-EOT
            #cloud-config
            package_upgrade: true
        EOT
      + core_os           = false
      + cpu_cap           = 0
      + cpu_weight        = 0
      + cpus              = 1
      + exp_nested_hvm    = false
      + hvm_boot_firmware = "bios"
      + id                = (known after apply)
      + ipv4_addresses    = (known after apply)
      + ipv6_addresses    = (known after apply)
      + memory_max        = 2147467264
      + name_label        = "XO terraform testing"
      + power_state       = (known after apply)
      + start_delay       = 0
      + template          = "9b0fd2ac-c89a-93b4-5103-8506391395cd"
      + vga               = "std"
      + videoram          = 8
      + wait_for_ip       = false

      + disk {
          + name_label = "VM root volume"
          + position   = (known after apply)
          + size       = 4294967296
          + sr_id      = "86a9757d-9c05-9fe0-e79a-8243cb1f37f3"
          + vbd_id     = (known after apply)
          + vdi_id     = (known after apply)
        }

      + network {
          + device         = (known after apply)
          + ipv4_addresses = (known after apply)
          + ipv6_addresses = (known after apply)
          + mac_address    = (known after apply)
          + network_id     = "6c4e1cdc-9fe0-0603-e53d-4790d1fce8dd"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

ddelnano@ddelnano-desktop:~/code/terraform/xolab (master) $ terraform apply
macaddress.mac: Refreshing state... [id=00:aa:af:cb:12:42]
xenorchestra_cloud_config.bar: Refreshing state... [id=051e055b-cbd0-4f16-843a-de55376ac96b]
xenorchestra_vm.vm: Refreshing state... [id=7af4a81c-fa5d-9b5b-e864-15564c02ff7f]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # xenorchestra_vm.vm will be created
  + resource "xenorchestra_vm" "vm" {
      + auto_poweron      = false
      + cloud_config      = <<-EOT
            #cloud-config
            package_upgrade: true
        EOT
      + core_os           = false
      + cpu_cap           = 0
      + cpu_weight        = 0
      + cpus              = 1
      + exp_nested_hvm    = false
      + hvm_boot_firmware = "bios"
      + id                = (known after apply)
      + ipv4_addresses    = (known after apply)
      + ipv6_addresses    = (known after apply)
      + memory_max        = 2147467264
      + name_label        = "XO terraform testing"
      + power_state       = (known after apply)
      + start_delay       = 0
      + template          = "9b0fd2ac-c89a-93b4-5103-8506391395cd"
      + vga               = "std"
      + videoram          = 8
      + wait_for_ip       = false

      + disk {
          + name_label = "VM root volume"
          + position   = (known after apply)
          + size       = 4294967296
          + sr_id      = "86a9757d-9c05-9fe0-e79a-8243cb1f37f3"
          + vbd_id     = (known after apply)
          + vdi_id     = (known after apply)
        }

      + network {
          + device         = (known after apply)
          + ipv4_addresses = (known after apply)
          + ipv6_addresses = (known after apply)
          + mac_address    = (known after apply)
          + network_id     = "6c4e1cdc-9fe0-0603-e53d-4790d1fce8dd"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

xenorchestra_vm.vm: Creating...
xenorchestra_vm.vm: Still creating... [10s elapsed]
xenorchestra_vm.vm: Still creating... [20s elapsed]
xenorchestra_vm.vm: Creation complete after 20s [id=b8aab65b-95bf-6274-a7bf-57703d581109]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
ddelnano@ddelnano-desktop:~/code/terraform/xolab (master) $ terraform state list
data.xenorchestra_network.network
data.xenorchestra_pool.pool
data.xenorchestra_sr.sr
data.xenorchestra_template.vm_template
macaddress.mac
xenorchestra_cloud_config.bar
xenorchestra_vm.vm

ddelnano@ddelnano-desktop:~/code/terraform/xolab (master) $ terraform state show xenorchestra_vm.vm
# xenorchestra_vm.vm:
resource "xenorchestra_vm" "vm" {
    auto_poweron      = false
    cloud_config      = <<-EOT
        #cloud-config
        package_upgrade: true
    EOT
    core_os           = false
    cpu_cap           = 0
    cpu_weight        = 0
    cpus              = 1
    exp_nested_hvm    = false
    hvm_boot_firmware = "bios"
    id                = "b8aab65b-95bf-6274-a7bf-57703d581109"
    ipv4_addresses    = []
    ipv6_addresses    = []
    memory_max        = 2147467264
    name_label        = "XO terraform testing"
    power_state       = "Running"
    start_delay       = 0
    template          = "9b0fd2ac-c89a-93b4-5103-8506391395cd"
    vga               = "std"
    videoram          = 8
    wait_for_ip       = false

    disk {
        attached   = true
        name_label = "VM root volume"
        position   = "0"
        size       = 4294967296
        sr_id      = "86a9757d-9c05-9fe0-e79a-8243cb1f37f3"
        vbd_id     = "12609971-b1ef-4d30-3113-87da16ac3587"
        vdi_id     = "e154f19a-ba3d-4a65-9254-40e811dce529"
    }

    network {
        attached       = true
        device         = "0"
        ipv4_addresses = []
        ipv6_addresses = []
        mac_address    = "02:6b:02:3b:2a:e6"
        network_id     = "6c4e1cdc-9fe0-0603-e53d-4790d1fce8dd"
    }
}
ddelnano@ddelnano-desktop:~/code/terraform/xolab (master) $ terraform init -upgrade

Initializing the backend...

Initializing provider plugins...
- Finding ivoronin/macaddress versions matching "0.3.0"...
- Finding terra-farm/xenorchestra versions matching "0.25.0"...
- Finding hashicorp/http versions matching "3.2.1"...
- Finding hashicorp/local versions matching "2.2.3"...
- Using previously-installed hashicorp/http v3.2.1
- Using previously-installed hashicorp/local v2.2.3
- Using previously-installed ivoronin/macaddress v0.3.0
- Installing terra-farm/xenorchestra v0.25.0...
- Installed terra-farm/xenorchestra v0.25.0 (self-signed, key ID 6A6E2EACF91F3875)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
ddelnano@ddelnano-desktop:~/code/terraform/xolab (master) $ terraform plan
macaddress.mac: Refreshing state... [id=00:aa:af:cb:12:42]
xenorchestra_cloud_config.bar: Refreshing state... [id=051e055b-cbd0-4f16-843a-de55376ac96b]
xenorchestra_vm.vm: Refreshing state... [id=b8aab65b-95bf-6274-a7bf-57703d581109]

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.
ddelnano@ddelnano-desktop:~/code/terraform/xolab (master) $ terraform --version
Terraform v0.14.11
+ provider registry.terraform.io/hashicorp/http v3.2.1
+ provider registry.terraform.io/hashicorp/local v2.2.3
+ provider registry.terraform.io/ivoronin/macaddress v0.3.0
+ provider registry.terraform.io/terra-farm/xenorchestra v0.25.0

Your version of Terraform is out of date! The latest version
is 1.6.0. You can update by downloading from https://www.terraform.io/downloads.html
```

</details>